RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_probe_reg.h
/* 0x020 : osd_pb_addr_04 */
#define OSD_PB_ADDR_04_OFFSET       (0x020)
#define OSD_PB_REG_OSD_PB_X_04      OSD_PB_REG_OSD_PB_X_04
#define OSD_PB_REG_OSD_PB_X_04_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_04_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_04_MSK  (((1U << OSD_PB_REG_OSD_PB_X_04_LEN) - 1) << OSD_PB_REG_OSD_PB_X_04_POS)
#define OSD_PB_REG_OSD_PB_X_04_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_04_LEN) - 1) << OSD_PB_REG_OSD_PB_X_04_POS))
#define OSD_PB_REG_OSD_PB_Y_04      OSD_PB_REG_OSD_PB_Y_04
#define OSD_PB_REG_OSD_PB_Y_04_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_04_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_04_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_04_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_04_POS)
#define OSD_PB_REG_OSD_PB_Y_04_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_04_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_04_POS))

/* 0x024 : osd_pb_addr_05 */
#define OSD_PB_ADDR_05_OFFSET       (0x024)
#define OSD_PB_REG_OSD_PB_X_05      OSD_PB_REG_OSD_PB_X_05
#define OSD_PB_REG_OSD_PB_X_05_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_05_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_05_MSK  (((1U << OSD_PB_REG_OSD_PB_X_05_LEN) - 1) << OSD_PB_REG_OSD_PB_X_05_POS)
#define OSD_PB_REG_OSD_PB_X_05_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_05_LEN) - 1) << OSD_PB_REG_OSD_PB_X_05_POS))
#define OSD_PB_REG_OSD_PB_Y_05      OSD_PB_REG_OSD_PB_Y_05
#define OSD_PB_REG_OSD_PB_Y_05_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_05_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_05_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_05_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_05_POS)
#define OSD_PB_REG_OSD_PB_Y_05_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_05_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_05_POS))

/* 0x028 : osd_pb_addr_06 */
#define OSD_PB_ADDR_06_OFFSET       (0x028)
#define OSD_PB_REG_OSD_PB_X_06      OSD_PB_REG_OSD_PB_X_06
#define OSD_PB_REG_OSD_PB_X_06_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_06_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_06_MSK  (((1U << OSD_PB_REG_OSD_PB_X_06_LEN) - 1) << OSD_PB_REG_OSD_PB_X_06_POS)
#define OSD_PB_REG_OSD_PB_X_06_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_06_LEN) - 1) << OSD_PB_REG_OSD_PB_X_06_POS))
#define OSD_PB_REG_OSD_PB_Y_06      OSD_PB_REG_OSD_PB_Y_06
#define OSD_PB_REG_OSD_PB_Y_06_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_06_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_06_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_06_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_06_POS)
#define OSD_PB_REG_OSD_PB_Y_06_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_06_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_06_POS))

/* 0x02C : osd_pb_addr_07 */
#define OSD_PB_ADDR_07_OFFSET       (0x02C)
#define OSD_PB_REG_OSD_PB_X_07      OSD_PB_REG_OSD_PB_X_07
#define OSD_PB_REG_OSD_PB_X_07_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_07_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_07_MSK  (((1U << OSD_PB_REG_OSD_PB_X_07_LEN) - 1) << OSD_PB_REG_OSD_PB_X_07_POS)
#define OSD_PB_REG_OSD_PB_X_07_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_07_LEN) - 1) << OSD_PB_REG_OSD_PB_X_07_POS))
#define OSD_PB_REG_OSD_PB_Y_07      OSD_PB_REG_OSD_PB_Y_07
#define OSD_PB_REG_OSD_PB_Y_07_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_07_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_07_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_07_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_07_POS)
#define OSD_PB_REG_OSD_PB_Y_07_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_07_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_07_POS))

/* 0x030 : osd_pb_addr_08 */
#define OSD_PB_ADDR_08_OFFSET       (0x030)
#define OSD_PB_REG_OSD_PB_X_08      OSD_PB_REG_OSD_PB_X_08
#define OSD_PB_REG_OSD_PB_X_08_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_08_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_08_MSK  (((1U << OSD_PB_REG_OSD_PB_X_08_LEN) - 1) << OSD_PB_REG_OSD_PB_X_08_POS)
#define OSD_PB_REG_OSD_PB_X_08_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_08_LEN) - 1) << OSD_PB_REG_OSD_PB_X_08_POS))
#define OSD_PB_REG_OSD_PB_Y_08      OSD_PB_REG_OSD_PB_Y_08
#define OSD_PB_REG_OSD_PB_Y_08_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_08_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_08_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_08_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_08_POS)
#define OSD_PB_REG_OSD_PB_Y_08_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_08_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_08_POS))

/* 0x034 : osd_pb_addr_09 */
#define OSD_PB_ADDR_09_OFFSET       (0x034)
#define OSD_PB_REG_OSD_PB_X_09      OSD_PB_REG_OSD_PB_X_09
#define OSD_PB_REG_OSD_PB_X_09_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_09_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_09_MSK  (((1U << OSD_PB_REG_OSD_PB_X_09_LEN) - 1) << OSD_PB_REG_OSD_PB_X_09_POS)
#define OSD_PB_REG_OSD_PB_X_09_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_09_LEN) - 1) << OSD_PB_REG_OSD_PB_X_09_POS))
#define OSD_PB_REG_OSD_PB_Y_09      OSD_PB_REG_OSD_PB_Y_09
#define OSD_PB_REG_OSD_PB_Y_09_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_09_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_09_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_09_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_09_POS)
#define OSD_PB_REG_OSD_PB_Y_09_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_09_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_09_POS))

/* 0x038 : osd_pb_addr_0a */
#define OSD_PB_ADDR_0A_OFFSET       (0x038)
#define OSD_PB_REG_OSD_PB_X_0A      OSD_PB_REG_OSD_PB_X_0A
#define OSD_PB_REG_OSD_PB_X_0A_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_0A_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_0A_MSK  (((1U << OSD_PB_REG_OSD_PB_X_0A_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0A_POS)
#define OSD_PB_REG_OSD_PB_X_0A_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_0A_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0A_POS))
#define OSD_PB_REG_OSD_PB_Y_0A      OSD_PB_REG_OSD_PB_Y_0A
#define OSD_PB_REG_OSD_PB_Y_0A_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_0A_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_0A_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_0A_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0A_POS)
#define OSD_PB_REG_OSD_PB_Y_0A_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_0A_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0A_POS))

/* 0x03C : osd_pb_addr_0b */
#define OSD_PB_ADDR_0B_OFFSET       (0x03C)
#define OSD_PB_REG_OSD_PB_X_0B      OSD_PB_REG_OSD_PB_X_0B
#define OSD_PB_REG_OSD_PB_X_0B_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_0B_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_0B_MSK  (((1U << OSD_PB_REG_OSD_PB_X_0B_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0B_POS)
#define OSD_PB_REG_OSD_PB_X_0B_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_0B_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0B_POS))
#define OSD_PB_REG_OSD_PB_Y_0B      OSD_PB_REG_OSD_PB_Y_0B
#define OSD_PB_REG_OSD_PB_Y_0B_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_0B_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_0B_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_0B_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0B_POS)
#define OSD_PB_REG_OSD_PB_Y_0B_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_0B_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0B_POS))

/* 0x040 : osd_pb_addr_0c */
#define OSD_PB_ADDR_0C_OFFSET       (0x040)
#define OSD_PB_REG_OSD_PB_X_0C      OSD_PB_REG_OSD_PB_X_0C
#define OSD_PB_REG_OSD_PB_X_0C_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_0C_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_0C_MSK  (((1U << OSD_PB_REG_OSD_PB_X_0C_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0C_POS)
#define OSD_PB_REG_OSD_PB_X_0C_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_0C_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0C_POS))
#define OSD_PB_REG_OSD_PB_Y_0C      OSD_PB_REG_OSD_PB_Y_0C
#define OSD_PB_REG_OSD_PB_Y_0C_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_0C_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_0C_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_0C_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0C_POS)
#define OSD_PB_REG_OSD_PB_Y_0C_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_0C_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0C_POS))

/* 0x044 : osd_pb_addr_0d */
#define OSD_PB_ADDR_0D_OFFSET       (0x044)
#define OSD_PB_REG_OSD_PB_X_0D      OSD_PB_REG_OSD_PB_X_0D
#define OSD_PB_REG_OSD_PB_X_0D_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_0D_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_0D_MSK  (((1U << OSD_PB_REG_OSD_PB_X_0D_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0D_POS)
#define OSD_PB_REG_OSD_PB_X_0D_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_0D_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0D_POS))
#define OSD_PB_REG_OSD_PB_Y_0D      OSD_PB_REG_OSD_PB_Y_0D
#define OSD_PB_REG_OSD_PB_Y_0D_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_0D_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_0D_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_0D_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0D_POS)
#define OSD_PB_REG_OSD_PB_Y_0D_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_0D_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0D_POS))

/* 0x048 : osd_pb_addr_0e */
#define OSD_PB_ADDR_0E_OFFSET       (0x048)
#define OSD_PB_REG_OSD_PB_X_0E      OSD_PB_REG_OSD_PB_X_0E
#define OSD_PB_REG_OSD_PB_X_0E_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_0E_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_0E_MSK  (((1U << OSD_PB_REG_OSD_PB_X_0E_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0E_POS)
#define OSD_PB_REG_OSD_PB_X_0E_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_0E_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0E_POS))
#define OSD_PB_REG_OSD_PB_Y_0E      OSD_PB_REG_OSD_PB_Y_0E
#define OSD_PB_REG_OSD_PB_Y_0E_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_0E_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_0E_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_0E_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0E_POS)
#define OSD_PB_REG_OSD_PB_Y_0E_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_0E_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0E_POS))

/* 0x04C : osd_pb_addr_0f */
#define OSD_PB_ADDR_0F_OFFSET       (0x04C)
#define OSD_PB_REG_OSD_PB_X_0F      OSD_PB_REG_OSD_PB_X_0F
#define OSD_PB_REG_OSD_PB_X_0F_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_0F_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_0F_MSK  (((1U << OSD_PB_REG_OSD_PB_X_0F_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0F_POS)
#define OSD_PB_REG_OSD_PB_X_0F_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_0F_LEN) - 1) << OSD_PB_REG_OSD_PB_X_0F_POS))
#define OSD_PB_REG_OSD_PB_Y_0F      OSD_PB_REG_OSD_PB_Y_0F
#define OSD_PB_REG_OSD_PB_Y_0F_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_0F_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_0F_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_0F_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0F_POS)
#define OSD_PB_REG_OSD_PB_Y_0F_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_0F_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_0F_POS))

/* 0x050 : osd_pb_addr_10 */
#define OSD_PB_ADDR_10_OFFSET       (0x050)
#define OSD_PB_REG_OSD_PB_X_10      OSD_PB_REG_OSD_PB_X_10
#define OSD_PB_REG_OSD_PB_X_10_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_10_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_10_MSK  (((1U << OSD_PB_REG_OSD_PB_X_10_LEN) - 1) << OSD_PB_REG_OSD_PB_X_10_POS)
#define OSD_PB_REG_OSD_PB_X_10_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_10_LEN) - 1) << OSD_PB_REG_OSD_PB_X_10_POS))
#define OSD_PB_REG_OSD_PB_Y_10      OSD_PB_REG_OSD_PB_Y_10
#define OSD_PB_REG_OSD_PB_Y_10_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_10_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_10_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_10_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_10_POS)
#define OSD_PB_REG_OSD_PB_Y_10_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_10_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_10_POS))

/* 0x054 : osd_pb_addr_11 */
#define OSD_PB_ADDR_11_OFFSET       (0x054)
#define OSD_PB_REG_OSD_PB_X_11      OSD_PB_REG_OSD_PB_X_11
#define OSD_PB_REG_OSD_PB_X_11_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_11_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_11_MSK  (((1U << OSD_PB_REG_OSD_PB_X_11_LEN) - 1) << OSD_PB_REG_OSD_PB_X_11_POS)
#define OSD_PB_REG_OSD_PB_X_11_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_11_LEN) - 1) << OSD_PB_REG_OSD_PB_X_11_POS))
#define OSD_PB_REG_OSD_PB_Y_11      OSD_PB_REG_OSD_PB_Y_11
#define OSD_PB_REG_OSD_PB_Y_11_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_11_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_11_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_11_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_11_POS)
#define OSD_PB_REG_OSD_PB_Y_11_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_11_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_11_POS))

/* 0x058 : osd_pb_addr_12 */
#define OSD_PB_ADDR_12_OFFSET       (0x058)
#define OSD_PB_REG_OSD_PB_X_12      OSD_PB_REG_OSD_PB_X_12
#define OSD_PB_REG_OSD_PB_X_12_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_12_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_12_MSK  (((1U << OSD_PB_REG_OSD_PB_X_12_LEN) - 1) << OSD_PB_REG_OSD_PB_X_12_POS)
#define OSD_PB_REG_OSD_PB_X_12_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_12_LEN) - 1) << OSD_PB_REG_OSD_PB_X_12_POS))
#define OSD_PB_REG_OSD_PB_Y_12      OSD_PB_REG_OSD_PB_Y_12
#define OSD_PB_REG_OSD_PB_Y_12_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_12_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_12_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_12_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_12_POS)
#define OSD_PB_REG_OSD_PB_Y_12_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_12_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_12_POS))

/* 0x05C : osd_pb_addr_13 */
#define OSD_PB_ADDR_13_OFFSET       (0x05C)
#define OSD_PB_REG_OSD_PB_X_13      OSD_PB_REG_OSD_PB_X_13
#define OSD_PB_REG_OSD_PB_X_13_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_13_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_13_MSK  (((1U << OSD_PB_REG_OSD_PB_X_13_LEN) - 1) << OSD_PB_REG_OSD_PB_X_13_POS)
#define OSD_PB_REG_OSD_PB_X_13_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_13_LEN) - 1) << OSD_PB_REG_OSD_PB_X_13_POS))
#define OSD_PB_REG_OSD_PB_Y_13      OSD_PB_REG_OSD_PB_Y_13
#define OSD_PB_REG_OSD_PB_Y_13_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_13_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_13_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_13_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_13_POS)
#define OSD_PB_REG_OSD_PB_Y_13_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_13_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_13_POS))

